; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	thermograph2 - mode
	thermograph0 - mode
	thermograph3 - mode
	image1 - mode
	Star2 - direction
	GroundStation3 - direction
	Star6 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	Star14 - direction
	Star15 - direction
	Star18 - direction
	Star21 - direction
	Star22 - direction
	Star25 - direction
	Star28 - direction
	Star29 - direction
	Star17 - direction
	GroundStation10 - direction
	GroundStation0 - direction
	GroundStation11 - direction
	Star24 - direction
	GroundStation4 - direction
	GroundStation13 - direction
	Star12 - direction
	Star20 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	GroundStation27 - direction
	GroundStation19 - direction
	GroundStation26 - direction
	Star16 - direction
	GroundStation1 - direction
	Star23 - direction
	Planet30 - direction
	Star31 - direction
	Phenomenon32 - direction
	Phenomenon33 - direction
	Star34 - direction
	Phenomenon35 - direction
	Planet36 - direction
	Phenomenon37 - direction
	Phenomenon38 - direction
	Planet39 - direction
	Star40 - direction
	Planet41 - direction
	Phenomenon42 - direction
	Phenomenon43 - direction
	Star44 - direction
	Star45 - direction
	Phenomenon46 - direction
	Star47 - direction
	Planet48 - direction
	Phenomenon49 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star24)
	(calibration_target instrument0 GroundStation11)
	(calibration_target instrument0 Star16)
	(calibration_target instrument0 Star12)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star17)
	(supports instrument1 image1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 GroundStation13)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star24)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star23)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation27)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation26)
	(calibration_target instrument2 Star16)
	(calibration_target instrument2 Star20)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star16)
	(calibration_target instrument3 GroundStation26)
	(calibration_target instrument3 GroundStation19)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star40)
	(supports instrument4 thermograph0)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star23)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon37)
)
(:goal (and
	(pointing satellite0 Star40)
	(pointing satellite1 Star34)
	(have_image Planet30 image1)
	(have_image Star31 image1)
	(have_image Phenomenon32 thermograph0)
	(have_image Phenomenon33 thermograph2)
	(have_image Star34 thermograph3)
	(have_image Phenomenon35 thermograph0)
	(have_image Planet36 thermograph3)
	(have_image Phenomenon37 thermograph2)
	(have_image Phenomenon38 image1)
	(have_image Planet39 thermograph3)
	(have_image Star40 image1)
	(have_image Planet41 thermograph0)
	(have_image Phenomenon42 thermograph0)
	(have_image Phenomenon43 thermograph0)
	(have_image Star44 thermograph2)
	(have_image Star45 thermograph0)
	(have_image Phenomenon46 image1)
	(have_image Star47 thermograph0)
	(have_image Planet48 thermograph0)
	(have_image Phenomenon49 thermograph2)
))

)

; plan
1. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 22
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 22
3. (turn_to satellite2 phenomenon32 phenomenon37)
   deleted: (pointing satellite2 phenomenon37)
   added: (pointing satellite2 phenomenon32)
   goals met: 0 of 22
4. (turn_to satellite1 star34 star40)
   deleted: (pointing satellite1 star40)
   added: (pointing satellite1 star34)
   goals met: 1 of 22
5. (turn_to satellite0 phenomenon33 star23)
   deleted: (pointing satellite0 star23)
   added: (pointing satellite0 phenomenon33)
   goals met: 1 of 22
6. (turn_to satellite2 star23 phenomenon32)
   deleted: (pointing satellite2 phenomenon32)
   added: (pointing satellite2 star23)
   goals met: 1 of 22
7. (calibrate satellite2 instrument4 star23)
   added: (calibrated instrument4)
   goals met: 1 of 22
8. (turn_to satellite2 phenomenon32 star23)
   deleted: (pointing satellite2 star23)
   added: (pointing satellite2 phenomenon32)
   goals met: 1 of 22
9. (take_image satellite2 phenomenon32 instrument4 thermograph0)
   added: (have_image phenomenon32 thermograph0)
   goals met: 2 of 22
10. (turn_to satellite2 phenomenon35 phenomenon32)
   deleted: (pointing satellite2 phenomenon32)
   added: (pointing satellite2 phenomenon35)
   goals met: 2 of 22
11. (take_image satellite2 phenomenon35 instrument4 thermograph0)
   added: (have_image phenomenon35 thermograph0)
   goals met: 3 of 22
12. (turn_to satellite2 phenomenon42 phenomenon35)
   deleted: (pointing satellite2 phenomenon35)
   added: (pointing satellite2 phenomenon42)
   goals met: 3 of 22
13. (take_image satellite2 phenomenon42 instrument4 thermograph0)
   added: (have_image phenomenon42 thermograph0)
   goals met: 4 of 22
14. (turn_to satellite2 phenomenon43 phenomenon42)
   deleted: (pointing satellite2 phenomenon42)
   added: (pointing satellite2 phenomenon43)
   goals met: 4 of 22
15. (take_image satellite2 phenomenon43 instrument4 thermograph0)
   added: (have_image phenomenon43 thermograph0)
   goals met: 5 of 22
16. (turn_to satellite2 planet36 phenomenon43)
   deleted: (pointing satellite2 phenomenon43)
   added: (pointing satellite2 planet36)
   goals met: 5 of 22
17. (take_image satellite2 planet36 instrument4 thermograph3)
   added: (have_image planet36 thermograph3)
   goals met: 6 of 22
18. (turn_to satellite2 planet39 planet36)
   deleted: (pointing satellite2 planet36)
   added: (pointing satellite2 planet39)
   goals met: 6 of 22
19. (take_image satellite2 planet39 instrument4 thermograph3)
   added: (have_image planet39 thermograph3)
   goals met: 7 of 22
20. (turn_to satellite2 planet41 planet39)
   deleted: (pointing satellite2 planet39)
   added: (pointing satellite2 planet41)
   goals met: 7 of 22
21. (take_image satellite2 planet41 instrument4 thermograph0)
   added: (have_image planet41 thermograph0)
   goals met: 8 of 22
22. (turn_to satellite2 planet48 planet41)
   deleted: (pointing satellite2 planet41)
   added: (pointing satellite2 planet48)
   goals met: 8 of 22
23. (take_image satellite2 planet48 instrument4 thermograph0)
   added: (have_image planet48 thermograph0)
   goals met: 9 of 22
24. (turn_to satellite2 star34 planet48)
   deleted: (pointing satellite2 planet48)
   added: (pointing satellite2 star34)
   goals met: 9 of 22
25. (take_image satellite2 star34 instrument4 thermograph3)
   added: (have_image star34 thermograph3)
   goals met: 10 of 22
26. (turn_to satellite2 star45 star34)
   deleted: (pointing satellite2 star34)
   added: (pointing satellite2 star45)
   goals met: 10 of 22
27. (take_image satellite2 star45 instrument4 thermograph0)
   added: (have_image star45 thermograph0)
   goals met: 11 of 22
28. (turn_to satellite2 star47 star45)
   deleted: (pointing satellite2 star45)
   added: (pointing satellite2 star47)
   goals met: 11 of 22
29. (take_image satellite2 star47 instrument4 thermograph0)
   added: (have_image star47 thermograph0)
   goals met: 12 of 22
30. (turn_to satellite0 star24 phenomenon33)
   deleted: (pointing satellite0 phenomenon33)
   added: (pointing satellite0 star24)
   goals met: 12 of 22
31. (calibrate satellite0 instrument1 star24)
   added: (calibrated instrument1)
   goals met: 12 of 22
32. (turn_to satellite0 phenomenon33 star24)
   deleted: (pointing satellite0 star24)
   added: (pointing satellite0 phenomenon33)
   goals met: 12 of 22
33. (take_image satellite0 phenomenon33 instrument1 thermograph2)
   added: (have_image phenomenon33 thermograph2)
   goals met: 13 of 22
34. (turn_to satellite0 phenomenon37 phenomenon33)
   deleted: (pointing satellite0 phenomenon33)
   added: (pointing satellite0 phenomenon37)
   goals met: 13 of 22
35. (take_image satellite0 phenomenon37 instrument1 thermograph2)
   added: (have_image phenomenon37 thermograph2)
   goals met: 14 of 22
36. (turn_to satellite0 phenomenon38 phenomenon37)
   deleted: (pointing satellite0 phenomenon37)
   added: (pointing satellite0 phenomenon38)
   goals met: 14 of 22
37. (take_image satellite0 phenomenon38 instrument1 image1)
   added: (have_image phenomenon38 image1)
   goals met: 15 of 22
38. (turn_to satellite0 phenomenon46 phenomenon38)
   deleted: (pointing satellite0 phenomenon38)
   added: (pointing satellite0 phenomenon46)
   goals met: 15 of 22
39. (take_image satellite0 phenomenon46 instrument1 image1)
   added: (have_image phenomenon46 image1)
   goals met: 16 of 22
40. (turn_to satellite0 phenomenon49 phenomenon46)
   deleted: (pointing satellite0 phenomenon46)
   added: (pointing satellite0 phenomenon49)
   goals met: 16 of 22
41. (take_image satellite0 phenomenon49 instrument1 thermograph2)
   added: (have_image phenomenon49 thermograph2)
   goals met: 17 of 22
42. (turn_to satellite0 planet30 phenomenon49)
   deleted: (pointing satellite0 phenomenon49)
   added: (pointing satellite0 planet30)
   goals met: 17 of 22
43. (take_image satellite0 planet30 instrument1 image1)
   added: (have_image planet30 image1)
   goals met: 18 of 22
44. (turn_to satellite0 star31 planet30)
   deleted: (pointing satellite0 planet30)
   added: (pointing satellite0 star31)
   goals met: 18 of 22
45. (take_image satellite0 star31 instrument1 image1)
   added: (have_image star31 image1)
   goals met: 19 of 22
46. (turn_to satellite0 star40 star31)
   deleted: (pointing satellite0 star31)
   added: (pointing satellite0 star40)
   goals met: 20 of 22
47. (take_image satellite0 star40 instrument1 image1)
   added: (have_image star40 image1)
   goals met: 21 of 22
48. (turn_to satellite0 star44 star40)
   deleted: (pointing satellite0 star40)
   added: (pointing satellite0 star44)
   goals met: 20 of 22
49. (take_image satellite0 star44 instrument1 thermograph2)
   added: (have_image star44 thermograph2)
   goals met: 21 of 22
50. (turn_to satellite0 star40 star44)
   deleted: (pointing satellite0 star44)
   added: (pointing satellite0 star40)
   goals met: 22 of 22
